PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
/**
 * @file mai_main.c
 * The main entry point of the C code, which implements sample application "default" of the
 * RTOS. The code found here configures and runs the RTOS. Some tasks are registered that
 * implement blinking LEDs and more.\n
 *   A cyclic 1ms task controls one LED such that it blinks at 1 Hz. The task reads the
 * state of the buttons on the evaluation board. On button press an according event task,
 * taskOnButtonDown, is activated.\n
 *   The event task taskOnButtonDown reports each button event by printing a message to the
 * serial COM channel. At the same time it increments the amount of CPU load by 10% load,
 * which is (artificially) produced by task taskCpuLoad. This is a cyclic task with a busy
 * wait loop.\n
 *   A cyclic 1000ms task toggles the second LED at a rate of 0.5 Hz.\n
 *   An event task taskNonCyclic is activated by several other tasks under different
 * conditions. It can be observed that the activation sometime succeeds and sometime fails.
 * Below it's explained why.\n
 *   The regular 1s task is used to report the system state, CPU load, stack usage and task
 * overrun events (more precise: failed activations).\n
 *   The idle task measures the CPU load.\n
 *   Three timer interrupts fire at high speed and on a time grid, which is asynchronous to
 * the normal application tasks. This leads to most variable preemption patterns. The
 * interrupts do nothing but producing system load and one of them participates the
 * software self-test (consistency check of shared data).
 *
 * The application should be run with a connected terminal. The terminal should be
 * configured for 115200 Bd, 8 Bits, no parity, 1 start and 1 stop bit.
 *
 * Some observations:\n
 *   Blinking LEDs: Note the slight phase shift due to the differing task start times.\n
 *   Reported CPU load: At nominal 100% artificial load the actual load drops to about 50%.
 * The execution time of the cyclic task that produces the load exceeds the nominal cycle
 * time of the task and every second activation is lost. The activation loss counter in the
 * RTOS' task array constantly increases.\n
 *   Occasional activation losses can be reported for task taskNonCyclic. It can be
 * preempted by task task17ms and this task activates task taskNonCyclic. If it tries to
 * do, while it has preempted task taskNonCyclic, the activation is not possible.\n
 *   The code runs a permanent test of the offered mechanism for mutual exclusion of tasks
 * that access some shared data objects. A recognized failure is reported by assertion,
 * which will halt the code execution (in DEBUG compilation only). Everything is fine as
 * long as the LEDs continue blinking.
 *
 * CAUTION: This safe-RTOS application only is a migration of the demo software from the
 * ancestor implementation of the RTOS, which didn't have the safety mechanisms. The
 * migrated application doesn't aim at demonstrating the design of a true safe application.
 * The major issue is that there's no clear visual separation of code belonging in the
 * spheres of a) an operating system, b) the functional application code and c) some
 * supervisory safety code.
 *
 * Copyright (C) 2017-2020 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   main
 * Local functions
 *   checkAndIncrementTaskCnts
 *   testPCP_checkDataConsistency
 *   testPCP
 *   isrPit1
 *   isrPit2
 *   isrPit3
 *   taskOs1ms
 *   onButtonChangeCallback
 *   task1ms
 *   task3ms
 *   task1s
 *   taskNonCyclic
 *   task17ms
 *   taskOnButtonDown
 *   taskCpuLoad
 *   installInterruptServiceRoutines
 *   taskInitProcess
 *   taskIdlePID2
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>
#include <float.h>
#include <limits.h>
#include <assert.h>

#include "MPC5643L.h"
#include "typ_types.h"
#include "ihw_initMcuCoreHW.h"
#include "lbd_ledAndButtonDriver.h"
#include "sio_serialIO.h"
#include "rtos.h"
#include "del_delay.h"
#include "gsl_systemLoad.h"
#include "tcx_testContext.h"
#include "mai_main.h"


/*
 * Defines
 */

/** The demo can be compiled with a ground load. Most tasks produce some CPU load if this
    switch is set to 1. */
#define TASKS_PRODUCE_GROUND_LOAD   0

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.
      Here, for getting the resource, i.e. for entering a critical section of code. */
#define GetResource(idTask, resource)                                                       \
            {   uint32_t priorityLevelSoFar;                                                \
                if((idTask) <= lastUserTaskId)                                              \
                {                                                                           \
                    priorityLevelSoFar = rtos_suspendAllTasksByPriority                     \
                                                (/* suspendUpToThisPriority */ (resource)); \
                }                                                                           \
                else                                                                        \
                {                                                                           \
                    assert((idTask) < noRegisteredTasks ||  (idTask) == idTaskIdle);        \
                    priorityLevelSoFar = rtos_osSuspendAllTasksByPriority              \
                                                (/* suspendUpToThisPriority */ (resource)); \
                }

