PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.
      Here, for returning the resource, i.e. for leaving a critical section of code. */
#define ReleaseResource(idTask)                                                             \
                if((idTask) <= lastUserTaskId)                                              \
                    rtos_resumeAllTasksByPriority(priorityLevelSoFar);                      \
                else                                                                        \
                {                                                                           \
                    assert((idTask) < noRegisteredTasks ||  (idTask) == idTaskIdle);        \
                    rtos_osResumeAllTasksByPriority(priorityLevelSoFar);               \
                }                                                                           \
            }

/** The task counter array is accessed by all tasks. Here it is modelled as an OSEK/VDX
    like resource to be used with #GetResource and #ReleaseResource. */
#define RESOURCE_CNT_TASK_ARY   (RESOURCE_ALL_TASKS)

/** The priority level to set if all tasks should be mutually excluded from accessing a
    shared resource. The macro is named such that the code resembles the resource API from
    the OSEK/VDX standard. */
#define RESOURCE_ALL_TASKS  (MAXP(prioTask1ms,MAXP(prioTask3ms, \
                             MAXP(prioTask1s,MAXP(prioTaskNonCyclic, \
                             MAXP(prioTask17ms,MAXP(prioTaskOnButtonDown, \
                             prioTaskCpuLoad)))))))

/** The priority level to set for the atomic operations done in function testPCP(). The
    macro is named such that the code resembles the resource API from the OSEK/VDX
    standard. */
#define RESOURCE_TEST_PCP  (MAXP(prioTask1ms,MAXP(prioTaskCpuLoad,prioTaskIdle)))

/** Some helper code to get the maximum task priority as a constant for the priority ceiling
    protocol. */
#define MAXP(p1,p2)  ((p2)>(p1)?(p2):(p1))


/*
 * Local type definitions
 */

/** The enumeration of all events, tasks and priority, to have them as symbols in the
    source code. Most relevant are the event IDs. Actually, these IDs are provided by the
    RTOS at runtime, when creating the event. However, it is guaranteed that the IDs, which
    are dealt out by rtos_osCreateEvent() form the series 0, 1, 2, .... So we don't need
    to have a dynamic storage of the IDs; we define them as constants and double-check by
    assertion that we got the correct, expected IDs from rtos_osCreateEvent(). Note, this
    requires that the order of creating the events follows the order here in the
    enumeration. */
enum
{
    /** The ID of the created events. They occupy the index range starting from zero. */
    idEv1ms = 0
    , idEv3ms
    , idEv1s
    , idEvNonCyclic
    , idEv17ms
    , idEvOnButtonDown
    , idEvCpuLoad

    /** In this sample, we have a one by one relation between events and tasks for most
        tasks. We duplicate the event IDs to have task IDs, too. This is a remnant from the
        elder RTOS, where we had a strict one-by-one relation between events and tasks. */
    , idTask1ms          = idEv1ms
    , idTask3ms          = idEv3ms
    , idTask1s           = idEv1s
    , idTaskNonCyclic    = idEvNonCyclic
    , idTask17ms         = idEv17ms
    , idTaskOnButtonDown = idEvOnButtonDown
    , idTaskCpuLoad      = idEvCpuLoad

    /** Some derived enumeration values permit making the distinction between user and OS
        tasks by ID. */
    , tmpIdTask1
    , lastUserTaskId = tmpIdTask1 - 1
    , firstOsTaskId
    , tmpIdTask2 = firstOsTaskId - 1

    , idTaskOs1ms

    /** The number of tasks to register. */
    , noRegisteredTasks

    /** The idle task is not a task under control of the RTOS and it doesn't have an ID.
        We assign it a pseudo task ID that is used to store some task related data in the
        same array here in this sample application as we do by true task ID for all true
        tasks. */
    , idTaskIdle = noRegisteredTasks
};


/** The RTOS uses constant task priorities, which are defined here.\n
      Note, this is a remnant from the elder RTOS. Now, priority is a property of an event
    rather than of a task. A task implicitly inherits the priority of the event it is
    associated with. */
enum
{
    prioTask1ms = 2
    , prioTask3ms = 2
    , prioTask1s = 1
    , prioTaskNonCyclic = 3
    , prioTask17ms = 4
    , prioTaskOnButtonDown = 1
    , prioTaskCpuLoad = 1

    , prioTaskOs1ms = prioTask1ms /* same event, cannot have other prio */
    , prioTaskIdle = 0      /** Prio 0 is implicit for idle, cannot be chosen explicitly */

    , prioIrqPit1 = 5       /** INTC priority of timer IRQ PIT1 */
    , prioIrqPit2 = 6       /** INTC priority of timer IRQ PIT2 */
    , prioIrqPit3 = 15      /** INTC priority of timer IRQ PIT3 */
};


/** In safe-RTOS a task belongs to a process, characterized by the PID, 1..4. The
    relationship is defined here.\n
      Note, this is a remnant from the elder RTOS, where no process concept existed. Nearly
    all tasks belong to the one and only user process. We just added a single OS task.\n
      Note, a process needs to be configured in the linker script (actually: assignment of
    stack space) before it can be used. */
enum
{
    pidTask1ms = 1
    , pidTask3ms = 1
    , pidTask1s = 1
    , pidTaskNonCyclic = 1
    , pidTask17ms = 1
    , pidTaskOnButtonDown = 1
    , pidTaskCpuLoad = 1
    , pidTaskOs1ms = 0  /* A kernel or operating system task, e.g. to implement a polling
                           I/O driver. */
    , pidOnButtonChangeCallback = 1
    , pidTaskIdle = 0   /* PID 0 is implicit, idle belongs to kernel, kernel always is PID 0 */
};



