PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/** A task invokation counter, which is incremented by all application tasks. */
volatile unsigned long long _cntAllTasks SECTION(.bss.Shared) = 0;

/** A cycle counter for each task. The last entry is meant for the idle task. */
volatile unsigned long long _cntTaskAry[noRegisteredTasks+1] SECTION(.bss.Shared) =
                                                        {[0 ... noRegisteredTasks] = 0};

volatile unsigned long mai_cntTaskIdle SECTION(.bss.OS) = 0  /** Counter of cycles of
                                                                 infinite main loop. */ 
                     , mai_cntTask1ms SECTION(.bss.P1) = 0   /** Counter of cyclic task. */
                     , mai_cntTask3ms SECTION(.bss.P1) = 0   /** Counter of cyclic task. */
                     , mai_cntTask1s SECTION(.bss.P1) = 0    /** Counter of cyclic task. */
                     , mai_cntTaskNonCyclic SECTION(.bss.P1) = 0 /** Counter of calls of
                                                                     software triggered task */
                     , mai_cntTask17ms SECTION(.bss.P1) = 0  /** Counter of cyclic task. */
                     , mai_cntTaskOnButtonDown SECTION(.bss.P1) = 0 /** Counter of button
                                                                        event task. */
                     , mai_cntTaskCpuLoad SECTION(.bss.P1) = 0   /** Counter of cyclic task. */
                     , mai_cntActivationLossTaskNonCyclic SECTION(.bss.P1) = 0 /** Lost 
                                                                                   activations
                                                                                   of non
                                                                                   cyclic
                                                                                   task. */
                     , mai_cntISRPit1 SECTION(.bss.OS) = 0
                     , mai_cntISRPit2 SECTION(.bss.OS) = 0
                     , mai_cntISRPit3 SECTION(.bss.OS) = 0;

/** We have an idle task in process 2. */
volatile unsigned int mai_cntTaskIdlePID2 SECTION(.sdata.P2) = 0;

/** The color currently used by the interrupt handlers are controlled through selection of
    a pin. The selection is made by global variable. Here for D5. */
static volatile lbd_led_t _ledTask1s SECTION(.sdata.P1) = lbd_led_D5_grn;

/** The color currently used by the interrupt handlers are controlled through selection of
    a pin. The selection is made by global variable. Here for D4. */
static volatile lbd_led_t _ledTask1ms SECTION(.sdata.P1) = lbd_led_D4_red;

/** The average CPU load produced by all tasks and interrupts in tens of percent. */
unsigned int mai_cpuLoad SECTION(.data.OS) = 1000;

/** Test of CPU load estimation: This variable controls the production of some artificial
    CPU load. This is done in a task of low priority so that all higher prioritized task
    should not or barely be affected. (One LED is, the other isn't affected.) */
static unsigned int _cpuLoadInPercent SECTION(.sdata.P1) = 0;

/** Test of priority ceiling protocol. A sub-set of tasks, whereof non of highest priority
    in use, share this data object. It has redundant fields so that a sharing conflict can
    be recognized. Try compiling the code with bad resource definition and see if the
    problem is reported (in DEBUG compilation by assertion, too). */
static volatile struct sharedDataTasksIdleAnd1msAndCpuLoad_t
{
    /** Counter incremented on execution of task task1ms. */
    unsigned int cntTask1ms;

    /** Counter incremented on execution of task taskCpuLoad. */
    unsigned int cntTaskCpuLoad;

    /** Counter incremented on execution of the idle task. */
    unsigned int cntTaskIdle;

    /** Total count, sum of all others. */
    unsigned int cntTotal;

    /** The number of recognized data consistency errors. */
    unsigned int noErrors;

} _sharedDataTasksIdleAnd1msAndCpuLoad SECTION(.data.Shared) =
    { .cntTask1ms = 0
    , .cntTaskCpuLoad = 0
    , .cntTaskIdle = 0
    , .cntTotal = 0
    , .noErrors = 0
    };


/*
 * Function implementation
 */

/**
 * Test function, to be called from any of the tasks: A task related counter is incremented
 * and in the same atomic operation is a task-shared counter incremented. The function then
 * validates that the sum of all task related counters is identical to the value of the
 * shared counter. The test result is validated by assertion, i.e. the application is
 * halted in case of an error.
 *   The test is aimed to prove the correct implementation of the offered mutual exclusion
 * mechanisms.
 *   @param idTask
 * The ID (or index) of the calling task. Needed to identify the task related counter.
 */
static void checkAndIncrementTaskCnts(unsigned int idTask)
{
    /* Increment task related counter and shared counter in an atomic operation. */
    GetResource(idTask, RESOURCE_CNT_TASK_ARY);
    {
        assert(idTask < sizeOfAry(_cntTaskAry));
        ++ _cntTaskAry[idTask];
        ++ _cntAllTasks;
    }
    ReleaseResource(idTask);

    /* Get all task counters and the common counter in an atomic operation. */
    unsigned long long cntTaskAryCpy[noRegisteredTasks+1]
                     , cntAllTasksCpy;
    _Static_assert(sizeof(_cntTaskAry) == sizeof(cntTaskAryCpy), "Bad data definition");
    GetResource(idTask, RESOURCE_CNT_TASK_ARY);
    {
        memcpy(&cntTaskAryCpy[0], (void*)&_cntTaskAry[0], sizeof(cntTaskAryCpy));
        cntAllTasksCpy = _cntAllTasks;
    }
    ReleaseResource(idTask);

    /* Check consistency of got data. */
    unsigned int u;
    for(u=0; u<sizeOfAry(cntTaskAryCpy); ++u)
        cntAllTasksCpy -= cntTaskAryCpy[u];
    if(cntAllTasksCpy != 0)
    {
#ifdef DEBUG
        assert(false);
#else
        /* PRODUCTION compilation: Code execution can be halted only by the OS process. We
           leave this to the idle task.
             Note, incrementing the error count to make the idle task recognize the problem
           is not safe, we don't have a critical section for this object and the given
           task. */
        ++ _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors;
#endif
    }
} /* End of checkAndIncrementTaskCnts. */



/**
 * Helper function of PCP test: The shared data is checked for consistency and a global
 * error counter is incremented in case.
 *   @return
 * Get \a true as long as everything is alright.
 */
static bool testPCP_checkDataConsistency()
{
    const unsigned int sum = _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskIdle
                             + _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskCpuLoad
                             + _sharedDataTasksIdleAnd1msAndCpuLoad.cntTask1ms;
    if(sum != _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal)
    {
        /* Resynchronize to enable further error recognition. */
        _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal = sum;

        const unsigned int noErr = _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors+1;
        if(noErr > 0)
            _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors = noErr;

